{
  "Home": "Home",
  "About": "About Us",
  "Contact": "Contact",
  "Intro": "My name is Abraham and I am a software-developer enthusiast.",
  "Welcome": "Welcome to my web portfolio, here you can see my projects and contact me on work proposals.",
  "ContactInfo": "Contact Information",
  "ContactPhone": "Phone",
  "ContactAddress": "Address",
  "ContactHeader": "Contact form",
  "ContactIntro": "Name",
  "ContactMail": "Email",
  "ContactCTA": "I will contact you soon",
  "ContactMessage": "Message",
  "ContactSendMessage": "Send Message",
  "ContactGreeting": "Thanks for contacting me, I will get in contact with you soon.",
  "TimeLineTitle": "Experience & Journey",
  "TimeLineDateOpo": "March 2025 - Present",
  "TimeLineDescOpo": "Developing OpoFlash, a comprehensive EdTech platform. Architecting a microservices system with Next.js, Python (FSRS algorithm), and Docker to optimize study efficiency.",
  "TimeLineDateChecke": "February 2025",
  "TimeLineDescChecke": "Engineered CheckeApp, a real-time fact-checking platform. Implemented an asynchronous 4-step verification flow: question generation, source searching, human-in-the-loop validation, and final AI report generation using oRPC and Next.js.",
  "TimeLineDateStack": "January 2025",
  "TimeLineDescStack": "Contributed to the Open Source community by maintaining and improving the STACKForILIAS PHP plugin, enhancing mathematical assessment capabilities in LMS.",
  "TimeLineDateQaRdrobe": "December 2024",
  "TimeLineDescQaRdrobe": "A full-stack solution for EU Digital Product Passport (DPP) compliance in the fashion industry, powered by the Polygon blockchain and Supabase.",
  "TimeLineDescPortfolio": "Designed and built this portfolio using React, Vite, and Chakra UI, focusing on performance, accessibility, and modern design principles.",
  "TimeLineProjectButton": "View Project",
  "ProjectHeader": "Featured Projects",
  "ProjectOpoFlashDesc": "Full-stack EdTech platform for civil service exams. Features adaptive quizzes and a Python-based Spaced Repetition System (FSRS) microservice, orchestrated with Docker and Nginx.",
  "ProjectCheckeAppDesc": "AI-powered fact-checking platform that combats misinformation through a transparent, multi-step process. It orchestrates text analysis, automated source searching, and human validation to generate grounded reports, managed via an asynchronous polling architecture with oRPC and MySQL.",
  "ProjectStackDesc": "Active contributor to the open-source community. Engineered PHP solutions for the STACKForILIAS plugin, optimizing the integration between mathematical assessment tools and the ILIAS LMS.",
  "ProjectQaRdrobeDesc": "Comprehensive platform for Digital Product Passports (DPP) ensuring EU compliance. Leverages Polygon blockchain for traceability and Supabase for secure data management.",
  "ProjectPortfolioDesc": "Modern personal portfolio built with React, Vite, and Chakra UI. Features internationalization (i18n), automatic dark mode via semantic tokens, and responsive design.",
  "Project1Title": "Web Portfolio",
  "Project1Description": "Project created to show technical skills as well as known technologies and projects I have worked on.",
  "Project2Title": "Color Ease",
  "Project2Description": "Project created to help designers find color combinations for their projects.",
  "Project3Title": "Airport Manager",
  "Project3Description": "A robust desktop application for managing airport operations, including flight scheduling and gate assignments. Built with Java (Swing/JDBC) and MySQL, featuring a clean graphical interface and secure database integration.",
  "Project4Title": "QaRdrobe",
  "Project4Description": "A full-stack solution for EU Digital Product Passport (DPP) compliance in the fashion industry, powered by the Polygon blockchain and Supabase. It ensures transparency and traceability of a product's lifecycle.",
  "Project5Title": "ToDo List",
  "Project5Description": "A sleek task management application with real-time synchronization. Built with React and Firebase, it features secure user authentication and persistent cloud storage for task data.",
  "Project6Title": "Traceability smart contract",
  "Project6Description": "Solidity Smart Contract deployed on Polygon (Amoy) to immutably record garment data, ensuring the veracity of product passports.",
  "ProjectButton": "¡Visit!",
  "HeroSlogan": "If you can imagine it, you can code it",
  "HeroName": "Abraham Morales Rodríguez",
  "HeroTitle": "Full Stack Developer passionate about creating innovative and scalable solutions. Welcome to my portfolio!",
  "HeroDownload": "Download CV",
  "HeroStart": "Let's get started!",
  "AcademicTitle": "Academic Background",
  "AcademicGrade": "Web Application Development Higher Technician",
  "AcademicLocation": "Ies Hermanos Machado",
  "AcademicIdiom": "C1 Advanced Cambridge",
  "AcademicCourses": "Relevant Courses"
}
